maxboss10086/max_dsp/max/F28388D/F28388_empty_project/device/driverlib/inc/hw_erad.h
//*****************************************************************************
//
// The following are defines for the bit fields in the CTM_CNTL register
//
//*****************************************************************************
#define ERAD_CTM_CNTL_START_STOP_MODE  0x4U         // Start_stop mode bit
#define ERAD_CTM_CNTL_EVENT_MODE  0x8U         // Event mode bit
#define ERAD_CTM_CNTL_RST_ON_MATCH  0x10U        // Reset_on_match bit
#define ERAD_CTM_CNTL_STOP        0x40U        // Stop bit (Halt/No Halt of
                                               // CPU)
#define ERAD_CTM_CNTL_RTOSINT     0x80U        // RTOSINT bit
#define ERAD_CTM_CNTL_START_STOP_CUMULATIVE  0x100U       // Start stop cumulative bit
#define ERAD_CTM_CNTL_RST_EN      0x400U       // Enable Reset
#define ERAD_CTM_CNTL_CNT_INP_SEL_EN  0x800U       // Counter Input Select Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the CTM_STATUS register
//
//*****************************************************************************
#define ERAD_CTM_STATUS_EVENT_FIRED  0x1U         // Counter Event Fired bits
#define ERAD_CTM_STATUS_OVERFLOW  0x2U         // Counter Overflowed
#define ERAD_CTM_STATUS_MODULE_ID_S  2U
#define ERAD_CTM_STATUS_MODULE_ID_M  0xFFCU       // Identification bits
#define ERAD_CTM_STATUS_STATUS_S  12U
#define ERAD_CTM_STATUS_STATUS_M  0xF000U      // Status bits

//*****************************************************************************
//
// The following are defines for the bit fields in the CTM_INPUT_SEL register
//
//*****************************************************************************
#define ERAD_CTM_INPUT_SEL_CNT_INP_SEL_S  0U
#define ERAD_CTM_INPUT_SEL_CNT_INP_SEL_M  0x7FU        // Counter Input Select
#define ERAD_CTM_INPUT_SEL_STA_INP_SEL_S  8U
#define ERAD_CTM_INPUT_SEL_STA_INP_SEL_M  0x7F00U      // Counter Sart Input Select

//*****************************************************************************
//
// The following are defines for the bit fields in the CTM_CLEAR register
//
//*****************************************************************************
#define ERAD_CTM_CLEAR_EVENT_CLEAR  0x1U         // Clear EVENT_FIRED
#define ERAD_CTM_CLEAR_OVERFLOW_CLEAR  0x2U         // Clear OVERFLOW

//*****************************************************************************
//
// The following are defines for the bit fields in the CTM_INPUT_SEL_2 register
//
//*****************************************************************************
#define ERAD_CTM_INPUT_SEL_2_STO_INP_SEL_S  0U
#define ERAD_CTM_INPUT_SEL_2_STO_INP_SEL_M  0x7FU        // Counter Stop Input Select
#define ERAD_CTM_INPUT_SEL_2_RST_INP_SEL_S  8U
#define ERAD_CTM_INPUT_SEL_2_RST_INP_SEL_M  0x7F00U      // Counter Reset input Select

//*****************************************************************************
//
// The following are defines for the bit fields in the CTM_INPUT_COND register
//
//*****************************************************************************
#define ERAD_CTM_INPUT_COND_CTM_INP_INV  0x1U         // Counter Input Invert
#define ERAD_CTM_INPUT_COND_CTM_INP_SYNCH  0x2U         // Counter input synchronizer
                                               // enable
#define ERAD_CTM_INPUT_COND_STA_INP_INV  0x10U        // Start input Invert
#define ERAD_CTM_INPUT_COND_STA_INP_SYNCH  0x20U        // Start input synchronizer
                                               // enable
#define ERAD_CTM_INPUT_COND_STO_INP_INV  0x100U       // Stop input Invert
#define ERAD_CTM_INPUT_COND_STO_INP_SYNCH  0x200U       // Stop input synchronizer
                                               // enable
#define ERAD_CTM_INPUT_COND_RST_INP_INV  0x1000U      // Reset input Invert
#define ERAD_CTM_INPUT_COND_RST_INP_SYNCH  0x2000U      // Reset input synchronizer
                                               // enable

//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GLOBAL_CTRL register
//
//*****************************************************************************
#define ERAD_CRC_GLOBAL_CTRL_CRC1_INIT  0x1U         // Initialize CRC Module 1
#define ERAD_CRC_GLOBAL_CTRL_CRC2_INIT  0x2U         // Initialize CRC Module 2
#define ERAD_CRC_GLOBAL_CTRL_CRC3_INIT  0x4U         // Initialize CRC Module 3
#define ERAD_CRC_GLOBAL_CTRL_CRC4_INIT  0x8U         // Initialize CRC Module 4
#define ERAD_CRC_GLOBAL_CTRL_CRC5_INIT  0x10U        // Initialize CRC Module 5
#define ERAD_CRC_GLOBAL_CTRL_CRC6_INIT  0x20U        // Initialize CRC Module 6
#define ERAD_CRC_GLOBAL_CTRL_CRC7_INIT  0x40U        // Initialize CRC Module 7
#define ERAD_CRC_GLOBAL_CTRL_CRC8_INIT  0x80U        // Initialize CRC Module 8
#define ERAD_CRC_GLOBAL_CTRL_CRC1_EN  0x100U       // Enable CRC Module 1
#define ERAD_CRC_GLOBAL_CTRL_CRC2_EN  0x200U       // Enable CRC Module 2
#define ERAD_CRC_GLOBAL_CTRL_CRC3_EN  0x400U       // Enable CRC Module 3
#define ERAD_CRC_GLOBAL_CTRL_CRC4_EN  0x800U       // Enable CRC Module 4
#define ERAD_CRC_GLOBAL_CTRL_CRC5_EN  0x1000U      // Enable CRC Module 5
#define ERAD_CRC_GLOBAL_CTRL_CRC6_EN  0x2000U      // Enable CRC Module 6
#define ERAD_CRC_GLOBAL_CTRL_CRC7_EN  0x4000U      // Enable CRC Module 7
#define ERAD_CRC_GLOBAL_CTRL_CRC8_EN  0x8000U      // Enable CRC Module 8

//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_QUALIFIER register
//
//*****************************************************************************
#define ERAD_CRC_QUALIFIER_CRC_QUALIFIER_S  0U
#define ERAD_CRC_QUALIFIER_CRC_QUALIFIER_M  0x1FU        // CRC Qualifier Register
#endif
